

function Projects() {
    return (
        <>
            <div className="projectsPage">
                <h1 className="proj1proj"> Проект 1</h1>
                <div className="projCont">
                    <div className="imgBlock1">
                    </div>
                    <div className="textcont">
                        <p className="revText">Проект представляет собой оригинальное архитектурное решение, объединяющее различные геометрические формы — от классических объемов до динамичных элементов. Центральная часть здания выполнена в виде массивного куба, символизирующего стабильность и надежность конструкции. Его строгие линии подчеркиваются четкими гранями и плоскостями, создавая ощущение основательности и уверенности. Треугольная часть здания (холл) выполнена полностью из стекла что даёт хорошее освещение в дневное время. Этот элемент придает зданию динамику и визуально выделяет его среди окружающих построек. Треугольник также играет функциональную роль, становясь частью входной группы и зоны отдыха.</p>
                    </div>
                </div>

                {/* Второй проект  */}

                <h1 className="proj1proj"> Проект "ВОЛНА"</h1>
                <div className="projCont">
                    <div className="textBlock2">
                        <p className="revText">Здание поражает воображение своей необычной архитектурой, воплощённой в форме изящной морской волны. Гладкая поверхность фасада плавно изгибается вверх-вниз, создавая иллюзию движения и лёгкости. Стены выполнены из светлого стекла и металла, отражающих игру света и тени в течение дня, придавая зданию живость и динамику.
                            Это здание символизирует единение человека с природой, демонстрирует стремление к свободе и открытости новым идеям. Оно становится ярким акцентом городского пейзажа, привлекающим внимание и восхищением прохожих.Оно становится ярким акцентом городского пейзажа, привлекающим внимание и восхищением прохожих.Оно становится ярким акцентом городского пейзажа, привлекающим внимание и восхищением прохожих.</p>
                    </div>
                    <div className="imgBlock2">

                    </div>
                </div>

                {/* третий проект  */}

                <h1 className="proj2proj"> Проект "Стеклянный"</h1>
                <div className="projCont">
                    <div className="imgBlock3">
                    </div>
                    <div className="textcont3">
                        <p className="revText">Проект представляет собой оригинальное архитектурное решение, объединяющее различные геометрические формы — от классических объемов до динамичных элементов. Центральная часть здания выполнена в виде массивного куба, символизирующего стабильность и надежность конструкции. Его строгие линии подчеркиваются четкими гранями и плоскостями, создавая ощущение основательности и уверенности. Треугольная часть здания (холл) выполнена полностью из стекла что даёт хорошее освещение в дневное время. Этот элемент придает зданию динамику и визуально выделяет его среди окружающих построек. Треугольник также играет функциональную роль, становясь частью входной группы и зоны отдыха.</p>
                    </div>
                </div>


            </div>
        </>
    );
};

export default Projects


